HappyDg/TCU_LD6AT/SRC/SWC_BSW/SWC_BSW_MCAL/MCAL_TC23X_FLS_PMU/Fls_17_Pmu_ac.c
/******************************************************************************
**                                                                           **
** Copyright (C) Infineon Technologies (2013)                                **
**                                                                           **
** All rights reserved.                                                      **
**                                                                           **
** This document contains proprietary information belonging to Infineon      **
** Technologies. Passing on and copying of this document, and communication  **
** of its contents is not permitted without prior written authorization.     **
**                                                                           **
*******************************************************************************
**                                                                           **
**  $FILENAME   : Fls_17_Pmu_ac.c $                                          **
**                                                                           **
**  $CC VERSION : \main\31 $                                                 **
**                                                                           **
**  $DATE       : 2014-11-13 $                                               **
**                                                                           **
**  AUTHOR      : DL-AUTOSAR-Engineering                                     **
**                                                                           **
**  VENDOR      : Infineon Technologies                                      **
**                                                                           **
**  DESCRIPTION  : This file contains command sequences of Flash driver      **
**                                                                           **
**  MAY BE CHANGED BY USER [yes/no]: No                                      **
**                                                                           **
******************************************************************************/
/******************************************************************************
   Traceability   :
                    [cover parentID=DS_AS_FLS137,DS_AS_FLS211]
                    [/cover]
******************************************************************************/

/*******************************************************************************
**                      Includes                                              **
*******************************************************************************/
/* Inclusion of Tasking sfr file */
#include "IfxFlash_reg.h"

/* Inclusion of Flash header file */
#include "Fls_17_Pmu.h"

/* Include Flash Module access code File */
#include "Fls_17_Pmu_ac.h"

/*******************************************************************************
**                      Imported Compiler Switch Check                        **
*******************************************************************************/

/*******************************************************************************
**                      Private Macro Definitions                             **
*******************************************************************************/
/* size of data loaded into page buffer at a time - 8bytes */
#define FLS_LOAD_PAGE_SIZE   (8U)

/* number of words per FLS_LOAD_PAGE_SIZE */
#define FLS_17_TWO_WORDS     (2U)

/* For internal debugging */
#ifdef IFX_FLS_DEBUG01
#define VALUE_51  (((uint32)(0x00000051U)))
#endif

#ifdef IFX_FLS_DEBUG02
#define VALUE_A1  (((uint32)(0x000000A1U)))
#endif

#ifdef IFX_FLS_DEBUG05
extern volatile uint32 TestFls_DebugMask05;
#endif
#ifdef IFX_FLS_DEBUG06
extern volatile uint32 TestFls_DebugMask06;
#endif

/*******************************************************************************
**                      Private Type Definitions                              **
*******************************************************************************/

/*******************************************************************************
**                      Private Function Declarations                         **
*******************************************************************************/

IFX_LOCAL_INLINE boolean Fls_lCmdCycleTimeout05(uint32 InnerCount);

IFX_LOCAL_INLINE boolean Fls_lCmdCycleTimeout06(uint32 InnerCount);

/*******************************************************************************
**                      Global Constant Definitions                           **
*******************************************************************************/

/*******************************************************************************
**                      Global Variable Definitions                           **
*******************************************************************************/

/*******************************************************************************
**                      Private Constant Definitions                          **
*******************************************************************************/

/*******************************************************************************
**                      Private Variable Definitions                          **
*******************************************************************************/

/*******************************************************************************
**                      Global Function Definitions                           **
*******************************************************************************/
/*******************************************************************************
** Syntax : void Fls_WriteCmdCycles( volatile uint32 StartAddress,            **
**                                   uint32 PageAddress,                      **
**                                   const Fls_AddressType* ProgramDataPtr    **
**                                   uint8 WriteMode                          **
**                                )                                           **
**                                                                            **
** Service ID:                                                                **
**                                                                            **
** Sync/Async:  Synchronous                                                   **
**                                                                            **
** Reentrancy:  Non Re-entrant                                                **
**                                                                            **
** Parameters (in) : StartAddress,PageAddress, ProgramDataPtr and WriteMode   **
**                                                                            **
** Parameters (out): None                                                     **
**                                                                            **
** Return value    : void                                                     **
**                                                                            **
** Description : This routine contains flash write command cycles             **
*******************************************************************************/
#define FLS_17_PMU_START_SEC_SPL_CODE_WRITECMD_BEGIN
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
 allowed only for MemMap.h*/
#include "MemMap.h"
void Fls_WriteCmdCycles( volatile uint32 StartAddress,
                         uint32 PageAddress, 
                         const Fls_AddressType* ProgramDataPtr,
                         uint8 WriteMode
                       )
{
  uint32 InnerCount;
  const Fls_AddressType* pdata;
  Fls_17_Pmu_StateType* StatePtr;

