HappyDg/TCU_LD6AT/SRC/SWC_BSW/SWC_BSW_MCAL/MCAL_TC23X_FLS_PMU/Fls_17_Pmu_ac.c
  StatePtr = Fls_ConfigPtr->FlsStateVarPtr;
  StatePtr->FlsTimeoutErr = 0U;
  
  pdata = ProgramDataPtr;
   
  /* Enter the Page Mode */
  EnterPageMode(StartAddress, VALUE_5D);

  InnerCount = 0U;
  
  while((FLASH0_FSR.B.DFPAGE != 1U) && (InnerCount < FLS_CMDCYCLE_TIMEOUT))
  {
    InnerCount++;
  }
  
  /* Check for command cycle Timeout */
  if ((boolean)TRUE == Fls_lCmdCycleTimeout05(InnerCount))
  {
    StatePtr->FlsTimeoutErr = FLS_WRITE;
  }
  else
  /* Check DFPAGE bit was SET */
  {
    if(WriteMode == BURST_WRITE)
    {
      InnerCount = (FLS_BURST_PAGE_SIZE / FLS_LOAD_PAGE_SIZE);
    }
    else
    {
      InnerCount = (FLS_PAGE_SIZE / FLS_LOAD_PAGE_SIZE);
    }
    while(InnerCount != 0U)
    {
      /* Load the data */
      LoadPage(StartAddress, pdata);
      /* Page assembly buffer pointer gets incremented automatically */
      /*IFX_MISRA_RULE_17_04_STATUS=Pointer arithmetic is used to access
        user buffer efficiently*/
      pdata += FLS_17_TWO_WORDS;
      InnerCount--;
    }   
          
    /* cycle 1 */
    CycleAA50(StartAddress, PageAddress);
    /* cycle 2 */
    CycleAA58(StartAddress, VALUE_00);
 
    #ifdef IFX_FLS_DEBUG02
    /* cycle 3 */
    CycleAAA8(StartAddress, VALUE_A1);
    #else
    /* cycle 3 */
    CycleAAA8(StartAddress, VALUE_A0);
    #endif   
    /* cycle 4 */
    if(WriteMode == BURST_WRITE)
    {
      CycleAAA8(StartAddress, VALUE_7A);
    }
    else
    {
      CycleAAA8(StartAddress, VALUE_AA);
    }
     
    InnerCount = 0U;

    while((FLASH0_FSR.B.PROG != 1U) && (InnerCount < FLS_CMDCYCLE_TIMEOUT))
    {
      InnerCount++;
    }
    
    if ((boolean)TRUE == Fls_lCmdCycleTimeout06(InnerCount))
    {
      StatePtr->FlsTimeoutErr = FLS_WRITE;
    }
  }  
}
#define FLS_17_PMU_STOP_SEC_SPL_CODE_WRITECMD_BEGIN
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
 allowed only for MemMap.h*/
#include "MemMap.h"


/*******************************************************************************
** Syntax : void Fls_EraseCmdCycles(volatile uint32 StartAddress)             **
**                                                                            **
** Service ID:                                                                **
**                                                                            **
** Sync/Async:  Synchronous                                                   **
**                                                                            **
** Reentrancy:  Non Re-entrant                                                **
**                                                                            **
** Parameters (in) : StartAddress                                             **
**                                                                            **
** Parameters (out): None                                                     **
**                                                                            **
** Return value    : void                                                     **
**                                                                            **
** Description : This routine contains flash Erase command cycles             **
*******************************************************************************/
#define FLS_17_PMU_START_SEC_SPL_CODE_ERASECMD_BEGIN
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
 allowed only for MemMap.h*/
#include "MemMap.h"
void Fls_EraseCmdCycles(volatile uint32 StartAddress)
{ 
  uint32 InnerCount;
  Fls_17_Pmu_StateType* StatePtr;

  StatePtr = Fls_ConfigPtr->FlsStateVarPtr;
  StatePtr->FlsTimeoutErr = 0U;
  /* cycle 1 */

  if( StartAddress == DFLASH_BANK0_PHYSICAL )
  {
    CycleAA50(StartAddress, (uint32)DFLASH_BANK0_PHYSICAL);
  }
  else
  {
    CycleAA50(StartAddress, (uint32)DFLASH_BANK1_PHYSICAL);
  }
  
  /* cycle 2 */
  CycleAA58(StartAddress, FLS_ERASE_SECTORS);
  /* cycle 3 */
  CycleAAA8(StartAddress, VALUE_80);

  #ifdef IFX_FLS_DEBUG01
  /* cycle 4 */
  CycleAAA8(StartAddress, VALUE_51);
  #else  
  /* cycle 4 */
  CycleAAA8(StartAddress, VALUE_50);
  #endif
  
  InnerCount = 0U;

  while((FLASH0_FSR.B.ERASE != 1U) && (InnerCount < FLS_CMDCYCLE_TIMEOUT))
  {
    InnerCount++;
  }
  
  /*return Error there is a Timeout has happened */
  if ((boolean)TRUE == Fls_lCmdCycleTimeout05(InnerCount))
  {
    StatePtr->FlsTimeoutErr = FLS_ERASE;
  }
}
#define FLS_17_PMU_STOP_SEC_SPL_CODE_ERASECMD_BEGIN
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
 allowed only for MemMap.h*/
#include "MemMap.h"


#define FLS_17_PMU_START_SEC_CODE
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
 allowed only for MemMap.h*/
#include "MemMap.h"
/*******************************************************************************
** Syntax : void Fls_CallEraseCommand(volatile uint32 PhysicalAddress)        **
**                                                                            **
** Service ID:                                                                **
**                                                                            **
** Sync/Async:  Synchronous                                                   **
**                                                                            **
** Reentrancy:  Non Re-entrant                                                **
**                                                                            **
** Parameters (in) : PhysicalAddress                                          **
**                                                                            **
** Parameters (out): None                                                     **
**                                                                            **
** Return value    : void                                                     **
**                                                                            **
** Description : This routine calls flash Erase command cycles                **
*******************************************************************************/
void Fls_CallEraseCommand(volatile uint32 PhysicalAddress)
{
  (Fls_ConfigPtr->FlsAccessCodeErasePtr)(PhysicalAddress);
  
