HappyDg/TCU_LD6AT/SRC/SWC_BSW/SWC_BSW_MCAL/MCAL_TC23X_FLS_PMU/Fls_17_Pmu_ac.c
}

/*******************************************************************************
** Syntax : void Fls_CallWriteCommand(volatile uint32 PhysicalAddress, 
                          const Fls_17_Pmu_StateType *s_ptr,
                          uint8 WriteMode)                                    **
**                                                                            **
** Service ID:                                                                **
**                                                                            **
** Sync/Async:  Synchronous                                                   **
**                                                                            **
** Reentrancy:  Non Re-entrant                                                **
**                                                                            **
** Parameters (in) : PhysicalAddress, s_ptr, WriteMode                        **
**                                                                            **
** Parameters (out): None                                                     **
**                                                                            **
** Return value    : void                                                     **
**                                                                            **
** Description : This routine calls flash write command cycles                **
*******************************************************************************/
void Fls_CallWriteCommand(volatile uint32 PhysicalAddress, 
                          const Fls_17_Pmu_StateType *s_ptr,
                          uint8 WriteMode)
{
  (Fls_ConfigPtr->FlsAccessCodeWritePtr)(PhysicalAddress,
                s_ptr->FlsWriteAddress,
                (const Fls_AddressType*)(const void *)s_ptr->FlsWriteBufferPtr,
                WriteMode);
}

/*******************************************************************************
** Syntax : void Fls_ResetReadCmdCycle(void)                                  **
**                                                                            **
** Service ID:                                                                **
**                                                                            **
** Sync/Async:  Synchronous                                                   **
**                                                                            **
** Reentrancy:  Non Re-entrant                                                **
**                                                                            **
** Parameters (in) : None                                                     **
**                                                                            **
** Parameters (out): None                                                     **
**                                                                            **
** Return value    : void                                                     **
**                                                                            **
** Description : This routine contains flash Reset command cycles             **
*******************************************************************************/
void Fls_ResetReadCmdCycle(void)
{ 
  Cycle5554(FLS_BASE_ADDRESS, VALUE_F0);
}

/*******************************************************************************
** Syntax : void Fls_ClearStatusCmdCycle(void)                                **
**                                                                            **
** Service ID:                                                                **
**                                                                            **
** Sync/Async:  Synchronous                                                   **
**                                                                            **
** Reentrancy:  Non Re-entrant                                                **
**                                                                            **
** Parameters (in) : None                                                     **
**                                                                            **
** Parameters (out): None                                                     **
**                                                                            **
** Return value    : void                                                     **
**                                                                            **
** Description : This routine contains flash clear status command cycles      **
*******************************************************************************/
void Fls_ClearStatusCmdCycle(void)
{ 
  Cycle5554(FLS_BASE_ADDRESS, VALUE_FA);

  #ifdef FLS_RAM_EMULATION_TEST
  #if (FLS_RAM_EMULATION_TEST == 1U)
  FlsEmulation_ClearStatusCmdCycle();
  #endif
  #endif
}

/*******************************************************************************
** Syntax : void Fls_ResumeEraseCmdCycle(volatile uint32 StartAddress)        **
**                                                                            **
** Service ID:                                                                **
**                                                                            **
** Sync/Async:  Synchronous                                                   **
**                                                                            **
** Reentrancy:  Non Re-entrant                                                **
**                                                                            **
** Parameters (in) : StartAddress                                             **
**                                                                            **
** Parameters (out): None                                                     **
**                                                                            **
** Return value    : void                                                     **
**                                                                            **
** Description : This routine contains flash resume erase command cycles      **
*******************************************************************************/
void Fls_ResumeEraseCmdCycle(volatile uint32 StartAddress)
{ 
  /* cycle 1 */

  if( StartAddress == DFLASH_BANK0_PHYSICAL )
  {
    CycleAA50(StartAddress, DFLASH_BANK0_PHYSICAL);
  }
  else
  {
    CycleAA50(StartAddress, DFLASH_BANK1_PHYSICAL);
  }
  
  /* cycle 2 */
  CycleAA58(StartAddress, FLS_ERASE_SECTORS);
  /* cycle 3 */
  CycleAAA8(StartAddress, VALUE_70);
  /* cycle 4 */
  CycleAAA8(StartAddress, VALUE_CC);
  
