HappyDg/TCU_LD6AT/SRC/SWC_BSW/SWC_BSW_MCAL/MCAL_TC23X_FLS_PMU/Fls_17_Pmu_ac.c
}
/*******************************************************************************
**                      Private Function Definitions                          **
*******************************************************************************/

/*******************************************************************************
** Syntax: IFX_LOCAL_INLINE boolean Fls_lCmdCycleTimeout05(uint32 InnerCount) **
**                                                                            **
** Service ID: None                                                           **
**                                                                            **
** Sync/Async:  Synchronous                                                   **
**                                                                            **
** Reentrancy:  Non Re-entrant                                                **
**                                                                            **
** Parameters (in) : InnerCount - Delay count                                 **
**                                                                            **
** Parameters (out): None                                                     **
**                                                                            **
** Return value    : boolean                                                  **
**                                                                            **
** Description : This routine checks if command cycle timeout occured         **
*******************************************************************************/
IFX_LOCAL_INLINE boolean Fls_lCmdCycleTimeout05(uint32 InnerCount)
{
  boolean RetVal;
  
  #ifdef IFX_FLS_DEBUG05
  if ((InnerCount >= (uint32)FLS_CMDCYCLE_TIMEOUT) || (TestFls_DebugMask05))
  #else
  if (InnerCount >= (uint32)FLS_CMDCYCLE_TIMEOUT)
  #endif
  {
    RetVal = (boolean)TRUE; 
  }
  else
  {
    RetVal = (boolean)FALSE; 
  }
  return (RetVal);
}

/*******************************************************************************
** Syntax: IFX_LOCAL_INLINE boolean Fls_lCmdCycleTimeout06(uint32 InnerCount) **
**                                                                            **
** Service ID: None                                                           **
**                                                                            **
** Sync/Async:  Synchronous                                                   **
**                                                                            **
** Reentrancy:  Non Re-entrant                                                **
**                                                                            **
** Parameters (in) : InnerCount - Delay count                                 **
**                                                                            **
** Parameters (out): None                                                     **
**                                                                            **
** Return value    : boolean                                                  **
**                                                                            **
** Description : This routine checks if command cycle timeout occured         **
*******************************************************************************/
IFX_LOCAL_INLINE boolean Fls_lCmdCycleTimeout06(uint32 InnerCount)
{
  boolean RetVal;
  
  #ifdef IFX_FLS_DEBUG06
  if ((InnerCount >= FLS_CMDCYCLE_TIMEOUT) || (TestFls_DebugMask06))
  #else
  if (InnerCount >= FLS_CMDCYCLE_TIMEOUT)
  #endif
  {
    RetVal = (boolean)TRUE; 
  }
  else
  {
    RetVal = (boolean)FALSE; 
  }
  return (RetVal);
}

/*******************************************************************************
**                      End of File                                           **
*******************************************************************************/

#define FLS_17_PMU_STOP_SEC_CODE
/*IFX_MISRA_RULE_19_01_STATUS=File inclusion after pre-processor directives is
 allowed only for MemMap.h*/
#include "MemMap.h"

